---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Directcontext3dName
source: html/5642d5ad-5d9a-f9d6-d807-dbbc319c23a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Directcontext3dName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId Directcontext3dName { get; }
```